app/models/state.rb

  def default_values
    self.order ||= State.count + 1
---
SELECT COUNT(*) FROM "states" WHERE (1 = 1) AND ("states"."order" >= 26)

  def created_sequentially?
    order == State.count + 1
---
SELECT COUNT(*) FROM "states"

  def valid_order
    return if order && ((order - State.count < 1 && persisted?) || (order - State.count <= 1 && new_record?))
---
SELECT COUNT(*) FROM "states"