xpark_backend/app/controllers/api/v1/states_controller.rb

  def index
    states = State.all.order(:position)
---
SELECT "states".* FROM "states" ORDER BY "states"."position" ASC

  def create
    state = State.new(state_params)
    if state.save
---
INSERT INTO "states" ("name", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "454"], ["position", 4], ["created_at", "2022-02-01 21:02:51.864783"], ["updated_at", "2022-02-01 21:02:51.864783"]]

  def update
    if @state.update(state_params)
---
UPDATE "states" SET "position" = $1, "updated_at" = $2 WHERE "states"."id" = $3  [["position", 4], ["updated_at", "2022-02-01 22:02:49.182720"], ["id", 6]]

  def destroy
    @state.destroy
---
DELETE FROM "states" WHERE "states"."id" = $1  [["id", 1]]

  def set_state
    @state = State.find_by_id(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]