xpark_backend/app/controllers/api/v1/vehicles_controller.rb

  def index
    vehicles = current_api_v1_user.vehicles.includes(:current_state)
---
SELECT "states".* FROM "states" WHERE "states"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = $1  [["user_id", 1]]

  def create
    vehicle = current_api_v1_user.vehicles.new(vehicle_params)
    if vehicle.save
---
INSERT INTO "vehicles" ("name", "user_id", "current_state_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "bmw"], ["user_id", 3], ["current_state_id", 2], ["created_at", "2022-02-01 20:55:58.882798"], ["updated_at", "2022-02-01 20:55:58.882798"]]

  def update
    if @vehicle.update(vehicle_params)
---
UPDATE "vehicles" SET "current_state_id" = $1, "updated_at" = $2 WHERE "vehicles"."id" = $3  [["current_state_id", 2], ["updated_at", "2022-02-01 18:53:41.151351"], ["id", 1]]

  def destroy
    @vehicle.destroy
---
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 5]]

  def set_vehicle
    @vehicle = Vehicle.find_by_id(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]