xpark_backend/app/models/state.rb

  def default_values
    self.position ||= State.count + 1
---
SELECT COUNT(*) FROM "states" WHERE (1 = 1) AND ("states"."position" >= 3) AND ("states"."position" < 4 AND "states".id != 33)

  def created_sequentially?
    position == State.count + 1
---
SELECT COUNT(*) FROM "states"

  def valid_position
    return if position && ((position - State.count < 1 && persisted?) || (position - State.count <= 1 && new_record?))
---
SELECT COUNT(*) FROM "states"