xpark_backend/app/models/vehicle.rb

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def validate_state_order
    old_order = State.find(current_state_id_was).order

SELECT "states".* FROM "states" WHERE "states"."position" = $1 LIMIT $2  [["position", 1], ["LIMIT", 1]]
---
  def default_values
    self.current_state ||= State.find_by_position(1)